[
  {
    "heading": "Изучение слов",
    "paragraphs": [
      "Для пополнения словарного запаса по английскому языку приложения предлагает изучить 3600 часто употребляемых английских слов. Для этого в приложении есть необходимые инструменты, которые помогут быстро и эффективно выучить эти слова.",
      "Основная страница приложения - изучение слов. Обилие настроек позволяет настроить вид страницы наиболее удобный для каждого пользователя.",
      "Основные особенности процесса изучения слов. Впервые попадая на изучение слово считается \"Новым\" и имеет нулевой уровень изученности. При достижении нулевого уровня - можно считать слово изученным.",
      "Ответы без ошибок, с ошибками, через \"Показать ответ\" по-разному влияют на прогресс изучения слова. Для более точной настройки сложности слов после прохождения каждого слова можно проголосовать (если включена настройка \"Оценить сложность слова\")",
      "Ошибка при прохождении каждого слова отправляет его на дополнительный повтор.",
      "Приложение использует мотодику интервального повторения, как признанный метод эффективного запоминания новой информации. Время, когда нужно повторить слова, рассчитывается с учетом уровня изученности слов с помощью подобранной к ключевым временным интервалам повторения логарифмической функции.",
      "Основные настройки приложения: количество новых слов и слов на повторение. В первую очередь повторяются пройденные ранее слова (если наступил момент для них). Потом идут новые слова. Поэтому рекомендуется аккуратно выбирать количество новых слов, чтобы успевать вовремя повторять все пройденные ранее. При нарушении сроков повторения слов падает их запоминаемость и эффективность изучения.",
      "Установленный лимит \"Всего слов в день\" может быть превышен из-за незапланированных повторов (срочных повторов), которые случаются при неправильном вводе слов."
    ]
  },
  {
    "heading": "Игры",
    "paragraphs": [
      "Игры добавлены в приложения для увеличения эффективности запоминания слов - учись играя.",
      "Если пройден необходимый минимум слов (для каждый игры свой), игру можно запустить с изучаемым словами. На стартовом экране игры будет доступен соответствующий пункт. Правильные и ошибочные ответы будут влиять на уровень изученности слова.",
      "Игра с изучаемыми словами влияет на изученность слов. А ошибки отправят слова на повторение в ближайшей тренировке.",
      "Если слов недостаточно, игру запускается с выбором слов из наборов, разбитых по уровням сложности."
    ],
    "lists": [
      {
        "tittle": "Спринт:",
        "points": [
          "Ключевое значение имеет время. Есть всего 60 секунд, за которые нужно выбрать наибольшее количество правильных ответов.",
          "За серии правильных ответов без ошибок идут повышенные коэффициенты очков."
        ]
      },
      {
        "tittle": "Саванна:",
        "points": ["Количество ошибок ограничено жизнями."]
      },
      {
        "tittle": "Аудиовызов:",
        "points": [
          "Управление в игре возможно не только мышкой. Клавиши 1-5 - выбор ответа, стрелки или Ввод - \"дальше\"/\"не знаю\"."
        ]
      },
      {
        "tittle": "Фортуна:",
        "points": [
          "Нужно отгадать слова. Доступны три подсказки, которые в случайно порядке предлагаются каждый раз."
        ]
      },
      {
        "tittle": "Скажи это!:",
        "points": ["Тренируем произношение. Не забываем дать разрешение на микрофон приложению. "]
      }
    ]
  },
  {
    "heading": "Словарь",
    "lists": [
      {
        "tittle": "Изучаемые слова:",
        "points": [
          "Список изучаемых слов пользователя. После первого прохождения слово, оно добавляется на эту страничку.",
          "Слова отсортированы относительно повышения уровня изученности.",
          "Часть колонок отключается в настройках приложения: транскрипция, предложения со словом."
        ]
      },
      {
        "tittle": "Сложные слова:",
        "points": [
          "Если какие-то слова поддаются особенно тяжело, их можно добавить сюда. И потом дополнительно тренировать, запуская обучение соответствующей кнопкой."
        ]
      },
      {
        "tittle": "Удалённые слова",
        "points": [
          "Тут находятся слова, которые вручную были исключены из изучения. Их можно восстановить соответствующей кнопкой. Добавить сюда слова можно со страницы изучения слов, если опция включена в настройках."
        ]
      }
    ]
  }
]
