[
  {
    "heading": "Игра Спринт",
    "paragraphs": [
      "Игра \"Спринт\" представляет интересную игру на время. Стартовый экран данной игры содержит меню, в котором предоставляется возможность выбора уровня сложности, от одного до шести включительно.",
      "Игра максимально простая, но в тоже время полезная для человека который взялся за изучение английского языка. Суть игры заключается в постоянном выборе одного из двух вариантов \"верно\" или \"неверно\", таким образом пользователь отвечает на вопрос, в котором предоставляется слово и его перевод. За каждый верный ответ, пользователь получает +10 балллов, за каждый не верный ответ получает \"ничего\"."
    ],
    "lists": [
      {
        "tittle": "По окончанию игры пользователь видит модальное окно в котором изображается:",
        "points": [
          "количество набранных пользователем баллов во время текущей игры в \"спринт\"",
          "средний результат за все игры в \"спринт\"",
          "рекордное количество баллов за все подходы к данной игре"
        ]
      },
      {
        "tittle": "Так же по окончанию игры в модальном окне предоставляются 2 кнопки:",
        "points": [
          "ещё раз ( начнётся заново )",
          "ок ( пользователь попадёт на главную страницу приложения )"
        ]
      }
    ]
  },
  {
    "heading": "Страница \"о нас\"",
    "paragraphs": [
      "На странице \"о нас\" пользователь может посмотреть на информацию о разработчиках данного приложения, представляется каждый участник команды, описывается его вклад в разработку приложения."
    ]
  },
  {
    "heading": "Страница \"статистика\"",
    "paragraphs": [
      "Страница \"статистика\" предоставляет пользователю возможность отслеживания текущего состояния игры и собственного прогресса в изучении английского языка.",
      "Основным контентом данной страницы является таблица в которой отображаются следующие данные."
    ],
    "lists": [
      {
        "tittle": "Прогресс за весь период обучения:",
        "points": [
          "количество показанных слов;",
          "всего показано новых слов;",
          "сколько выучено слов за все время;",
          "количество слов cейчас на изучении;",
          "сколько правильных ответов."
        ]
      },
      {
        "tittle": "Прогресс за сегодня:",
        "points": [
          "осталось изучить новых слов сегодня;",
          "осталось слов на повторение сегодня;",
          "всего сегодня было показано карточек;",
          "правильных ответов сегодня;",
          "самая длинная серия."
        ]
      },
      {
        "tittle": "Дополнительным контентом страницы \"статистика\" являются графики отображающие следующие показатели:",
        "points": [
          "количество выученных слов за каждый из 15 последних дней;",
          "сколько показано карточек всего за каждый из 15 последних дней;",
          "сколько отгадано карточек всего за каждый из 15 последних дней;",
          "сколько показано новых карточек за каждый из 15 последних дней."
        ]
      }
    ]
  },
  {
    "heading": "Страница словарь",
    "lists": [
      {
        "tittle": "Страница словарь содержит три вкладки \"Изучаемые слова\", \"Сложные слова\", \"Удалённые слова\".",
        "points": [
          " Во вкладке \"Изучаемые слова\" есть список изучаемых слов с примером звучания слова, переводом, а также примерами предложений с объяснением значения слова, примером использования слова, транскрипцией, если последние указаны в настройках",
          "Во вкладке \"Сложные слова\" находятся слова которые во время игры \"изучение слов\" с помощью специальной кнопки ( наличие которой можно отключить в настройках ) были добавлены в эту вкладку, помещённые в эту группу слова можно изучать отдельно от остальных. Возле каждого сложного слова есть кнопка \"Восстановить\", которая удаляет слово из категории \"сложные\" и возвращает его в общий перечень изучаемых слов.",
          "Во вкладке \"Удалённые слова\" сохраняются слова, которые пользователь не хочет видеть, там их можно просмотреть. Возле каждого удалённого слова есть кнопка \"Восстановить слово для изучения\", которая возвращает его в перечень изучаемых слов."
        ]
      }
    ]
  },
  {
    "heading": "Изучение слов",
    "paragraphs": [
      "Изучение слов позволяет пользователю изучать английский язык посредством перевода находящихся в карточках слов. Слова приложение предоставляет вместе с транскрипцией, картинками-ассоциациями, так же пользователю предоставляются 2 примера предложений, в которых переводимое слово закрыто звёздочками.",
      "Если слово набрано без ошибок, автоматически начинается озвучивание примеров предложений ( можно отключать показ транскрипции, автовоспроизведение предложений и показ картинки-ассоциации ), при нажатии на клавишу Enter происходит переход к следующей карточке с новым словом. Если слово было набрано с ошибками, в окне для ввода слова отображается изучаемое слово, в котором совпадающие буквы подсвечиваются зелёным, а несовпадающие красным или оранжевым цветом, в зависимости от количества ошибок. Затем изучаемое слово становится полупрозрачным, когда пользователь снова начинает вводить ответ, изучаемое слово исчезает с поля ввода.",
      "Так же пользователю предоставляется кнопка \"Показать ответ\", при нажатии на которую будет показан перевод слова ( её наличие так же регулируется в настройках ).",
      "Карточки со словами содержат как новые слова, так и слова, которые нужно повторить.",
      "На странице приложения присутствует шкала на которой отображается общее количество карточек со словами на сегодня и количество уже изученных карточек. Цветом на шкале отображается прогресс изучения.",
      "Под каждым изучаемым словом, после того, как оно угадано, появляются кнопки \"Снова\", \"Трудно\", \"Хорошо\", \"Легко\" или аналогичные, при помощи которых пользователь может указать индивидуальную сложность изучаемого слова. Наличие этих кнопок на странице регулируется настройками приложения.",
      "Если при изучении слова была допущена ошибка, или пользователь нажал на кнопку \"Снова\", карточка с этим словом вновь появится для изучения на текущей тренировке.",
      "Если в изучаемом слове была допущена ошибка в ходе мини-игры, карточка с ним появится на ближайшей тренировке."
    ]
  }
]
